Белгипрозем_2017/src/Documents/мДеноминацияУчетДоговоров/мДеноминацияУчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мДеноминацияУчетДоговоров</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.мСтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсвобождениеОтНДС</name>
      <type>
        <types>CatalogRef.мОсвобождениеОтНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДо</name>
      <comment>Сумма с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПосле</name>
      <comment>Сумма с НДС</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДСДо</name>
      <comment>НДС до деноминации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДСПосле</name>
      <comment>НДС после деноминации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяДо</name>
      <comment>Сметная стоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяПосле</name>
      <comment>Сметная стоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/мДеноминацияУчетДоговоров/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	              |	ДанныеДокумента.Ссылка.Дата КАК Период,
	              |	ДанныеДокумента.Ссылка КАК Ссылка,
	              |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	              |	ДанныеДокумента.Договор КАК Договор,
	              |	ДанныеДокумента.ЭтапДоговора КАК ЭтапДоговора,
	              |	ДанныеДокумента.СуммаПосле - ДанныеДокумента.СуммаДо КАК Сумма,
	              |	ДанныеДокумента.НДСПосле - ДанныеДокумента.НДСДо КАК НДС,
	              |	ДанныеДокумента.СтавкаНДС,
	              |	ДанныеДокумента.ОсвобождениеОтНДС,
	              |	"""" КАК НомерДокумента
	              |ИЗ
	              |	Документ.мДеноминацияУчетДоговоров.УчетДоговоров КАК ДанныеДокумента
	              |ГДЕ
	              |	ДанныеДокумента.Ссылка = &Ссылка";
	
    Результат = Запрос.Выполнить().Выгрузить();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
